arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/source/F2837xS_Dma.c
//###########################################################################
//
// FILE:    F2837xS_DMA.c
//
// TITLE:   F2837xS Device DMA Initialization & Support Functions.
//
//###########################################################################
// $TI Release: F2837xS Support Library v170 $
// $Release Date: Mon Sep 21 16:56:07 CDT 2015 $
// $Copyright: Copyright (C) 2014-2015 Texas Instruments Incorporated -
//             http://www.ti.com/ ALL RIGHTS RESERVED $
//###########################################################################

#include "F2837xS_device.h"     // Headerfile Include File
#include "F2837xS_Examples.h"   // Examples Include File

// This function initializes the DMA to a known state.
//
void DMAInitialize(void)
{
    EALLOW;

    // Perform a hard reset on DMA
    DmaRegs.DMACTRL.bit.HARDRESET = 1;
   __asm (" nop"); // one NOP required after HARDRESET

    // Allow DMA to run free on emulation suspend
    DmaRegs.DEBUGCTRL.bit.FREE = 1;

    EDIS;
}


void DMACH1AddrConfig(volatile Uint16 *DMA_Dest,volatile Uint16 *DMA_Source)
{
    EALLOW;
    // Set up SOURCE address:
    DmaRegs.CH1.SRC_BEG_ADDR_SHADOW = (Uint32)DMA_Source;   // Point to beginning of source buffer
    DmaRegs.CH1.SRC_ADDR_SHADOW =     (Uint32)DMA_Source;

    // Set up DESTINATION address:
    DmaRegs.CH1.DST_BEG_ADDR_SHADOW = (Uint32)DMA_Dest;     // Point to beginning of destination buffer
    DmaRegs.CH1.DST_ADDR_SHADOW =     (Uint32)DMA_Dest;


    EDIS;
}

void DMACH1BurstConfig(Uint16 bsize, int16 srcbstep, int16 desbstep)
{
    EALLOW;

    // Set up BURST registers:
    DmaRegs.CH1.BURST_SIZE.all = bsize;                 // Number of words(X-1) x-ferred in a burst
    DmaRegs.CH1.SRC_BURST_STEP = srcbstep;              // Increment source addr between each word x-ferred
    DmaRegs.CH1.DST_BURST_STEP = desbstep;              // Increment dest addr between each word x-ferred


    EDIS;
}

void DMACH1TransferConfig(Uint16 tsize, int16 srctstep, int16 deststep)
{
    EALLOW;

    // Set up TRANSFER registers:
    DmaRegs.CH1.TRANSFER_SIZE = tsize;                  // Number of bursts per transfer, DMA interrupt will occur after completed transfer
    DmaRegs.CH1.SRC_TRANSFER_STEP = srctstep;           // TRANSFER_STEP is ignored when WRAP occurs
    DmaRegs.CH1.DST_TRANSFER_STEP = deststep;           // TRANSFER_STEP is ignored when WRAP occurs

    EDIS;
}

void DMACH1WrapConfig(Uint16 srcwsize, int16 srcwstep, Uint16 deswsize, int16 deswstep)
{
    EALLOW;

        // Set up WRAP registers:
    DmaRegs.CH1.SRC_WRAP_SIZE = srcwsize;               // Wrap source address after N bursts
    DmaRegs.CH1.SRC_WRAP_STEP = srcwstep;               // Step for source wrap

    DmaRegs.CH1.DST_WRAP_SIZE = deswsize;               // Wrap destination address after N bursts
    DmaRegs.CH1.DST_WRAP_STEP = deswstep;               // Step for destination wrap

    EDIS;
}


void DMACH1ModeConfig(Uint16 persel, Uint16 perinte, Uint16 oneshot, Uint16 cont, Uint16 synce, Uint16 syncsel, Uint16 ovrinte, Uint16 datasize, Uint16 chintmode, Uint16 chinte)
{
    EALLOW;

    // Set up MODE Register:
    DmaClaSrcSelRegs.DMACHSRCSEL1.bit.CH1 = persel; // Source select
    DmaRegs.CH1.MODE.bit.PERINTSEL = 1;             // Should be hard coded to channel, above now selects source
    DmaRegs.CH1.MODE.bit.PERINTE = perinte;         // Peripheral interrupt enable
    DmaRegs.CH1.MODE.bit.ONESHOT = oneshot;         // Oneshot enable
    DmaRegs.CH1.MODE.bit.CONTINUOUS = cont;         // Continuous enable
    DmaRegs.CH1.MODE.bit.OVRINTE = ovrinte;         // Enable/disable the overflow interrupt
    DmaRegs.CH1.MODE.bit.DATASIZE = datasize;       // 16-bit/32-bit data size transfers
    DmaRegs.CH1.MODE.bit.CHINTMODE = chintmode;     // Generate interrupt to CPU at beginning/end of transfer
    DmaRegs.CH1.MODE.bit.CHINTE = chinte;           // Channel Interrupt to CPU enable

    // Clear any spurious flags:
    DmaRegs.CH1.CONTROL.bit.PERINTCLR = 1;          // Clear any spurious interrupt flags
    DmaRegs.CH1.CONTROL.bit.ERRCLR = 1;             // Clear any spurious sync error flags

    // Initialize PIE vector for CPU interrupt:
    PieCtrlRegs.PIEIER7.bit.INTx1 = 1;              // Enable DMA CH1 interrupt in PIE

    EDIS;
}

// This function starts DMA Channel 1.
void StartDMACH1(void)
{
    EALLOW;
    DmaRegs.CH1.CONTROL.bit.RUN = 1;
    EDIS;
}

void DMACH2AddrConfig(volatile Uint16 *DMA_Dest,volatile Uint16 *DMA_Source)
{
    EALLOW;

    // Set up SOURCE address:
    DmaRegs.CH2.SRC_BEG_ADDR_SHADOW = (Uint32)DMA_Source;   // Point to beginning of source buffer
    DmaRegs.CH2.SRC_ADDR_SHADOW =     (Uint32)DMA_Source;

    // Set up DESTINATION address:
    DmaRegs.CH2.DST_BEG_ADDR_SHADOW = (Uint32)DMA_Dest;     // Point to beginning of destination buffer
    DmaRegs.CH2.DST_ADDR_SHADOW =     (Uint32)DMA_Dest;


    EDIS;
}

void DMACH2BurstConfig(Uint16 bsize, int16 srcbstep, int16 desbstep)
{
    EALLOW;

    // Set up BURST registers:
    DmaRegs.CH2.BURST_SIZE.all = bsize;                 // Number of words(X-1) x-ferred in a burst
    DmaRegs.CH2.SRC_BURST_STEP = srcbstep;              // Increment source addr between each word x-ferred
    DmaRegs.CH2.DST_BURST_STEP = desbstep;              // Increment dest addr between each word x-ferred


    EDIS;
}

void DMACH2TransferConfig(Uint16 tsize, int16 srctstep, int16 deststep)
{
    EALLOW;

        // Set up TRANSFER registers:
    DmaRegs.CH2.TRANSFER_SIZE = tsize;                  // Number of bursts per transfer, DMA interrupt will occur after completed transfer
    DmaRegs.CH2.SRC_TRANSFER_STEP = srctstep;           // TRANSFER_STEP is ignored when WRAP occurs
    DmaRegs.CH2.DST_TRANSFER_STEP = deststep;           // TRANSFER_STEP is ignored when WRAP occurs

    EDIS;
}

void DMACH2WrapConfig(Uint16 srcwsize, int16 srcwstep, Uint16 deswsize, int16 deswstep)
{
    EALLOW;

        // Set up WRAP registers:
    DmaRegs.CH2.SRC_WRAP_SIZE = srcwsize;               // Wrap source address after N bursts
    DmaRegs.CH2.SRC_WRAP_STEP = srcwstep;               // Step for source wrap

    DmaRegs.CH2.DST_WRAP_SIZE = deswsize;               // Wrap destination address after N bursts
    DmaRegs.CH2.DST_WRAP_STEP = deswstep;               // Step for destination wrap

    EDIS;
}


void DMACH2ModeConfig(Uint16 persel, Uint16 perinte, Uint16 oneshot, Uint16 cont, Uint16 synce, Uint16 syncsel, Uint16 ovrinte, Uint16 datasize, Uint16 chintmode, Uint16 chinte)
{
    EALLOW;

        // Set up MODE Register:
    DmaClaSrcSelRegs.DMACHSRCSEL1.bit.CH2 = persel; // Source select
    DmaRegs.CH2.MODE.bit.PERINTSEL = 2;             // Should be hard coded to channel, above now selects source
    DmaRegs.CH2.MODE.bit.PERINTE = perinte;         // Peripheral interrupt enable
    DmaRegs.CH2.MODE.bit.ONESHOT = oneshot;         // Oneshot enable
    DmaRegs.CH2.MODE.bit.CONTINUOUS = cont;         // Continuous enable
    DmaRegs.CH2.MODE.bit.OVRINTE = ovrinte;         // Enable/disable the overflow interrupt
    DmaRegs.CH2.MODE.bit.DATASIZE = datasize;       // 16-bit/32-bit data size transfers
    DmaRegs.CH2.MODE.bit.CHINTMODE = chintmode;     // Generate interrupt to CPU at beginning/end of transfer
    DmaRegs.CH2.MODE.bit.CHINTE = chinte;           // Channel Interrupt to CPU enable

    // Clear any spurious flags:
    DmaRegs.CH2.CONTROL.bit.PERINTCLR = 1;          // Clear any spurious interrupt flags
    DmaRegs.CH2.CONTROL.bit.ERRCLR = 1;             // Clear any spurious sync error flags

    // Initialize PIE vector for CPU interrupt:
    PieCtrlRegs.PIEIER7.bit.INTx2 = 1;              // Enable DMA CH2 interrupt in PIE

    EDIS;
}



// This function starts DMA Channel 2.
void StartDMACH2(void)
{
    EALLOW;
    DmaRegs.CH2.CONTROL.bit.RUN = 1;
    EDIS;
}



void DMACH3AddrConfig(volatile Uint16 *DMA_Dest,volatile Uint16 *DMA_Source)
{
    EALLOW;

    // Set up SOURCE address:
    DmaRegs.CH3.SRC_BEG_ADDR_SHADOW = (Uint32)DMA_Source;   // Point to beginning of source buffer
    DmaRegs.CH3.SRC_ADDR_SHADOW =     (Uint32)DMA_Source;

    // Set up DESTINATION address:
    DmaRegs.CH3.DST_BEG_ADDR_SHADOW = (Uint32)DMA_Dest;     // Point to beginning of destination buffer
    DmaRegs.CH3.DST_ADDR_SHADOW =     (Uint32)DMA_Dest;


    EDIS;
}

