arduino/Arduino/hardware/c2000/cores/c2000/F2837xS_common/source/F2837xS_Dma.c
void DMACH3BurstConfig(Uint16 bsize, int16 srcbstep, int16 desbstep)
{
    EALLOW;

    // Set up BURST registers:
    DmaRegs.CH3.BURST_SIZE.all = bsize;                 // Number of words(X-1) x-ferred in a burst
    DmaRegs.CH3.SRC_BURST_STEP = srcbstep;              // Increment source addr between each word x-ferred
    DmaRegs.CH3.DST_BURST_STEP = desbstep;              // Increment dest addr between each word x-ferred


    EDIS;
}

void DMACH3TransferConfig(Uint16 tsize, int16 srctstep, int16 deststep)
{
    EALLOW;

        // Set up TRANSFER registers:
    DmaRegs.CH3.TRANSFER_SIZE = tsize;                  // Number of bursts per transfer, DMA interrupt will occur after completed transfer
    DmaRegs.CH3.SRC_TRANSFER_STEP = srctstep;           // TRANSFER_STEP is ignored when WRAP occurs
    DmaRegs.CH3.DST_TRANSFER_STEP = deststep;           // TRANSFER_STEP is ignored when WRAP occurs

    EDIS;
}

void DMACH3WrapConfig(Uint16 srcwsize, int16 srcwstep, Uint16 deswsize, int16 deswstep)
{
    EALLOW;

            // Set up WRAP registers:
    DmaRegs.CH3.SRC_WRAP_SIZE = srcwsize;               // Wrap source address after N bursts
    DmaRegs.CH3.SRC_WRAP_STEP = srcwstep;               // Step for source wrap

    DmaRegs.CH3.DST_WRAP_SIZE = deswsize;               // Wrap destination address after N bursts
    DmaRegs.CH3.DST_WRAP_STEP = deswstep;               // Step for destination wrap

    EDIS;
}


void DMACH3ModeConfig(Uint16 persel, Uint16 perinte, Uint16 oneshot, Uint16 cont, Uint16 synce, Uint16 syncsel, Uint16 ovrinte, Uint16 datasize, Uint16 chintmode, Uint16 chinte)
{
    EALLOW;

    // Set up MODE Register:
    DmaClaSrcSelRegs.DMACHSRCSEL1.bit.CH3 = persel; // Source select
    DmaRegs.CH3.MODE.bit.PERINTSEL = 3;             // Should be hard coded to channel, above now selects source
    DmaRegs.CH3.MODE.bit.PERINTE = perinte;         // Peripheral interrupt enable
    DmaRegs.CH3.MODE.bit.ONESHOT = oneshot;         // Oneshot enable
    DmaRegs.CH3.MODE.bit.CONTINUOUS = cont;         // Continuous enable
    DmaRegs.CH3.MODE.bit.OVRINTE = ovrinte;         // Enable/disable the overflow interrupt
    DmaRegs.CH3.MODE.bit.DATASIZE = datasize;       // 16-bit/32-bit data size transfers
    DmaRegs.CH3.MODE.bit.CHINTMODE = chintmode;     // Generate interrupt to CPU at beginning/end of transfer
    DmaRegs.CH3.MODE.bit.CHINTE = chinte;           // Channel Interrupt to CPU enable

    // Clear any spurious flags:
    DmaRegs.CH3.CONTROL.bit.PERINTCLR = 1;          // Clear any spurious interrupt flags
    DmaRegs.CH3.CONTROL.bit.ERRCLR = 1;             // Clear any spurious sync error flags

    // Initialize PIE vector for CPU interrupt:
    PieCtrlRegs.PIEIER7.bit.INTx3 = 1;              // Enable DMA CH3 interrupt in PIE

    EDIS;
}

// This function starts DMA Channel 3.
void StartDMACH3(void)
{
    EALLOW;
    DmaRegs.CH3.CONTROL.bit.RUN = 1;
    EDIS;
}


void DMACH4AddrConfig(volatile Uint16 *DMA_Dest,volatile Uint16 *DMA_Source)
{
    EALLOW;

    // Set up SOURCE address:
    DmaRegs.CH4.SRC_BEG_ADDR_SHADOW = (Uint32)DMA_Source;   // Point to beginning of source buffer
    DmaRegs.CH4.SRC_ADDR_SHADOW =     (Uint32)DMA_Source;

    // Set up DESTINATION address:
    DmaRegs.CH4.DST_BEG_ADDR_SHADOW = (Uint32)DMA_Dest;     // Point to beginning of destination buffer
    DmaRegs.CH4.DST_ADDR_SHADOW =     (Uint32)DMA_Dest;


    EDIS;
}

void DMACH4BurstConfig(Uint16 bsize, int16 srcbstep, int16 desbstep)
{
    EALLOW;

    // Set up BURST registers:
    DmaRegs.CH4.BURST_SIZE.all = bsize;                 // Number of words(X-1) x-ferred in a burst
    DmaRegs.CH4.SRC_BURST_STEP = srcbstep;              // Increment source addr between each word x-ferred
    DmaRegs.CH4.DST_BURST_STEP = desbstep;              // Increment dest addr between each word x-ferred


    EDIS;
}

void DMACH4TransferConfig(Uint16 tsize, int16 srctstep, int16 deststep)
{
    EALLOW;

    // Set up TRANSFER registers:
    DmaRegs.CH4.TRANSFER_SIZE = tsize;                  // Number of bursts per transfer, DMA interrupt will occur after completed transfer
    DmaRegs.CH4.SRC_TRANSFER_STEP = srctstep;           // TRANSFER_STEP is ignored when WRAP occurs
    DmaRegs.CH4.DST_TRANSFER_STEP = deststep;           // TRANSFER_STEP is ignored when WRAP occurs

    EDIS;
}

void DMACH4WrapConfig(Uint16 srcwsize, int16 srcwstep, Uint16 deswsize, int16 deswstep)
{
    EALLOW;

        // Set up WRAP registers:
    DmaRegs.CH4.SRC_WRAP_SIZE = srcwsize;               // Wrap source address after N bursts
    DmaRegs.CH4.SRC_WRAP_STEP = srcwstep;               // Step for source wrap

    DmaRegs.CH4.DST_WRAP_SIZE = deswsize;               // Wrap destination address after N bursts
    DmaRegs.CH4.DST_WRAP_STEP = deswstep;               // Step for destination wrap

    EDIS;
}


void DMACH4ModeConfig(Uint16 persel, Uint16 perinte, Uint16 oneshot, Uint16 cont, Uint16 synce, Uint16 syncsel, Uint16 ovrinte, Uint16 datasize, Uint16 chintmode, Uint16 chinte)
{
    EALLOW;

        // Set up MODE Register:
    DmaClaSrcSelRegs.DMACHSRCSEL1.bit.CH4 = persel; // Source select
    DmaRegs.CH4.MODE.bit.PERINTSEL = 4;             // Should be hard coded to channel, above now selects source
    DmaRegs.CH4.MODE.bit.PERINTE = perinte;         // Peripheral interrupt enable
    DmaRegs.CH4.MODE.bit.ONESHOT = oneshot;         // Oneshot enable
    DmaRegs.CH4.MODE.bit.CONTINUOUS = cont;         // Continuous enable
    DmaRegs.CH4.MODE.bit.OVRINTE = ovrinte;         // Enable/disable the overflow interrupt
    DmaRegs.CH4.MODE.bit.DATASIZE = datasize;       // 16-bit/32-bit data size transfers
    DmaRegs.CH4.MODE.bit.CHINTMODE = chintmode;     // Generate interrupt to CPU at beginning/end of transfer
    DmaRegs.CH4.MODE.bit.CHINTE = chinte;           // Channel Interrupt to CPU enable

    // Clear any spurious flags:
    DmaRegs.CH4.CONTROL.bit.PERINTCLR = 1;          // Clear any spurious interrupt flags
    DmaRegs.CH4.CONTROL.bit.ERRCLR = 1;             // Clear any spurious sync error flags

    // Initialize PIE vector for CPU interrupt:
    PieCtrlRegs.PIEIER7.bit.INTx4 = 1;              // Enable DMA CH4 interrupt in PIE

    EDIS;
}


// This function starts DMA Channel 4.
void StartDMACH4(void)
{
    EALLOW;
    DmaRegs.CH4.CONTROL.bit.RUN = 1;
    EDIS;
}


void DMACH5AddrConfig(volatile Uint16 *DMA_Dest,volatile Uint16 *DMA_Source)
{
    EALLOW;

    // Set up SOURCE address:
    DmaRegs.CH5.SRC_BEG_ADDR_SHADOW = (Uint32)DMA_Source;   // Point to beginning of source buffer
    DmaRegs.CH5.SRC_ADDR_SHADOW =     (Uint32)DMA_Source;

    // Set up DESTINATION address:
    DmaRegs.CH5.DST_BEG_ADDR_SHADOW = (Uint32)DMA_Dest;     // Point to beginning of destination buffer
    DmaRegs.CH5.DST_ADDR_SHADOW =     (Uint32)DMA_Dest;


    EDIS;
}

void DMACH5BurstConfig(Uint16 bsize, int16 srcbstep, int16 desbstep)
{
    EALLOW;


    // Set up BURST registers:
    DmaRegs.CH5.BURST_SIZE.all = bsize;                 // Number of words(X-1) x-ferred in a burst
    DmaRegs.CH5.SRC_BURST_STEP = srcbstep;              // Increment source addr between each word x-ferred
    DmaRegs.CH5.DST_BURST_STEP = desbstep;              // Increment dest addr between each word x-ferred

    EDIS;
}

